Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_ll_sdmmc.c
  /* 8 is the number of required instructions cycles for the below loop statement.
  The SDIO_CMDTIMEOUT is expressed in ms */
  register uint32_t count = SDIO_CMDTIMEOUT * (SystemCoreClock / 8U /1000U);
  
  do
  {
    if (count-- == 0U)
    {
      return SDMMC_ERROR_TIMEOUT;
    }
    sta_reg = SDIOx->INTSTS;
  }while((sta_reg & (SDIO_FLAG_RE | SDIO_FLAG_CD | SDIO_FLAG_RCRC | SDIO_FLAG_RTO_BAR)) == 0U);
    
  if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_RTO_BAR))
  {
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_RTO_BAR);
    
    return SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_RCRC))
  {
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_RCRC);
    
    return SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_RE))
  {
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_RE);
    
    return SDMMC_ERROR_CMD_RSP_ERR;
  }
  else
  {

  }
  
  /* Check response received is of desired command */
  if(SDIO_GetCommandResponse(SDIOx) != SD_CMD)
  {
    return SDMMC_ERROR_CMD_CRC_FAIL;
  }
  
  /* Clear all the static flags */
  __SDIO_CLEAR_FLAG(SDIOx, SDIO_STATIC_CMD_FLAGS);
  
  /* We have received response, retrieve it.  */
  response_r1 = SDIO_GetResponse(SDIOx, SDIO_RESP1);
  
  if((response_r1 & (SDMMC_R6_GENERAL_UNKNOWN_ERROR | SDMMC_R6_ILLEGAL_CMD | SDMMC_R6_COM_CRC_FAILED)) == SDMMC_ALLZERO)
  {
    *pRCA = (uint16_t) (response_r1 >> 16);
    
    return SDMMC_ERROR_NONE;
  }
  else if((response_r1 & SDMMC_R6_ILLEGAL_CMD) == SDMMC_R6_ILLEGAL_CMD)
  {
    return SDMMC_ERROR_ILLEGAL_CMD;
  }
  else if((response_r1 & SDMMC_R6_COM_CRC_FAILED) == SDMMC_R6_COM_CRC_FAILED)
  {
    return SDMMC_ERROR_COM_CRC_FAILED;
  }
  else
  {
    return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
  }
}

/**
  * @brief  Checks for error conditions for R7 response.
  * @param  SDIOx: SD handle
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp7(SDIO_TypeDef *SDIOx)
{
  uint32_t sta_reg;
  /* 8 is the number of required instructions cycles for the below loop statement.
  The SDIO_CMDTIMEOUT is expressed in ms */
  register uint32_t count = SDIO_CMDTIMEOUT * (SystemCoreClock / 8U /1000U);
  
  do
  {
    if (count-- == 0U)
    {
      return SDMMC_ERROR_TIMEOUT;
    }
    sta_reg = SDIOx->INTSTS;
  }while((sta_reg & (SDIO_FLAG_RE | SDIO_FLAG_CD | SDIO_FLAG_RCRC | SDIO_FLAG_RTO_BAR)) == 0U);
  
  if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_RE))
  {
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_RE);
    
    return SDMMC_ERROR_CMD_RSP_ERR;
  }
  else if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_RCRC))
  {
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_RCRC);
    
    return SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_RTO_BAR))
  {
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_RTO_BAR);
    
    return SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else
  {
    /* Nothing to do */
  }
  
  if(__SDIO_GET_FLAG(SDIOx, SDIO_FLAG_CD))
  {
    /* Card is SD V2.0 compliant */
    __SDIO_CLEAR_FLAG(SDIOx, SDIO_FLAG_CD);
  }
  
  return SDMMC_ERROR_NONE;
  
}

/**
  * @}
  */

#endif /* HAL_SD_MODULE_ENABLED || HAL_MMC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

#endif /* SDIO */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
